def flatten_list(lst):
    pass # тут ваш код 


assert flatten_list([1, [2, 3]]) == [1, 2, 3], "Ожидался простой плоский список"
assert flatten_list([1, [2, [3, [4]]]]) == [1, 2, 3, 4], "Ожидалась глубокая распаковка"
assert flatten_list([]) == [], "Ожидался пустой список"
assert flatten_list([[], [1], [], [2, [], 3]]) == [1, 2, 3], "Ожидалось игнорирование пустых вложенных списков"
assert flatten_list([1, ["a", ["b", "c"]], 2]) == [1, "a", "b", "c", 2], "Ожидалась корректная распаковка смешанных типов"
